Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`. Days returned will be tuples consisting of a day number and a week day number.
pl: Zwróć przedmiot iterujący dla *miesiąca* - z ang. - *month* w *roku* - z ang. - *year* podobnego do :meth:`itermonthdates`. Dni zwracane będą krotkami składającymi się z numeru dnia i numeru dnia tygodnia.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`. Days returned will simply be day numbers.
pl: Zwróć przedmiot iterujący dla *miesiąca* w *roku* - z ang. - *month* in the *year* podobnego do :meth:`itermonthdates`. Dni zwracane będą po prostu numerami dni.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven :class:`datetime.date` objects.
pl: Zwróć listę tygodni w *miesiącach* - z ang. - *month* *roku* - z ang. - *year* jako pełnych tygodni. Tygodnie są listami siedmiu przedmiotów :class:`datetime.date`.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven tuples of day numbers and weekday numbers.
pl: Zwróć listę tygodni w *miesiącu*, *roku* jako pełnych tygodni. Tygodnie są listami siedmiu krotek numerów dni i numerów dni tygodnia.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven day numbers.
pl: Zwróć listę tygodni w *miesiącu*, *roku* jako pełnych tygodni. Tygodnie są listami siedmio-dniowych liczb.

source: Return the data for the specified year ready for formatting. The return value is a list of month rows. Each month row contains up to *width* months (defaulting to 3). Each month contains between 4 and 6 weeks and each week contains 1--7 days. Days are :class:`datetime.date` objects.
pl: Zwróć dane dla określonego roku gotowe do formatowania. Wartość zwracana jest listą wierszy-miesięcy. Każdy wiersz miesięcy zawiera *szerokość* - z ang. - *width* miesięcy (domyślnie 3). Każdy miesiąc zawiera pomiędzy 4 a 6 tygodni a każdy tydzień zawiera między 1--7 dni. Dni są przedmiotami uogólnienia :class:`datetime.date`.

source: Return the data for the specified year ready for formatting (similar to :meth:`yeardatescalendar`). Entries in the week lists are tuples of day numbers and weekday numbers. Day numbers outside this month are zero.
pl: Zwróć dane dla określonego roku gotowe do formatowania (podobne do sposobu postępowania :meth:`yeardatescalendar`). Wpisy na listach tygodni są krotkami numerów dni i numerów dni tygodnia. Numery dni poza tym miesiącem są równe zero.

source: Return the data for the specified year ready for formatting (similar to :meth:`yeardatescalendar`). Entries in the week lists are day numbers. Day numbers outside this month are zero.
pl: Zwróć dane dla określonego roku gotowe do formatowania (podobne do sposobu postępowania :meth:`yeardatescalendar`). Wpisy na listach tygodni są numerami dni. Numery dni poza tym miesiącem są równe zero.

source: This class can be used to generate plain text calendars.
pl: To uogólnienie może być używane do utworzenia kalendarzy czystym tekstem.

source: :class:`TextCalendar` instances have the following methods:
pl: Przykłady uogólnienia :class:`TextCalendar` mają następujące sposoby postępowania:

source: Return a month's calendar in a multi-line string. If *w* is provided, it specifies the width of the date columns, which are centered. If *l* is given, it specifies the number of lines that each week will use. Depends on the first weekday as specified in the constructor or set by the :meth:`setfirstweekday` method.
pl: Zwróć kalendarz miesiąca w wielo-liniowym ciągu znaków. Jeśli *w* jest dostarczony, określa szerokość kolumn daty, które są wycentrowane. Jeśli *l* jest dane, określa liczbę linii, których każdy tydzień będzie używał. Zależy od pierwszego dnia tygodnia jak określono w konstruktorze lub ustawiono sposobem postępowania :meth:`setfirstweekday`.

source: Print a month's calendar as returned by :meth:`formatmonth`.
pl: Wydrukuj miesięczny kalendarz jak zwrócono przez sposób postępowania :meth:`formatmonth`.

source: Return a *m*-column calendar for an entire year as a multi-line string. Optional parameters *w*, *l*, and *c* are for date column width, lines per week, and number of spaces between month columns, respectively. Depends on the first weekday as specified in the constructor or set by the :meth:`setfirstweekday` method. The earliest year for which a calendar can be generated is platform-dependent.
pl: Zwróć *m*-kolumnowy kalendarz dla całego roku jako wielo-liniowy ciąg znaków. Opcjonalne parametry *w*, *l*, i *c* służą szerokości kolumn dat, linii na tydzień i liczby odstępów pomiędzy kolumnami miesięcy, odpowiednio. Zależy od pierwszego dnia tygodnia jak określono w konstruktorze lub ustawiono sposobem postępowania :meth:`setfirstweekday`. Najwcześniejszy rok dla którego kalendarz może być wytworzony zależy od maszyny/środowiska.

source: Print the calendar for an entire year as returned by :meth:`formatyear`.
pl: Drukuj kalendarz dla całego roku jak zwrócono ze sposobu postępowania :meth:`formatyear`.

source: This class can be used to generate HTML calendars.
pl: To uogólnienie może być używane do wytworzenia kalendarzy HTML.

source: :class:`HTMLCalendar` instances have the following methods:
pl: Przykłady uogólnienia :class:`HTMLCalendar` mają następujące sposoby postępowania:

source: Return a month's calendar as an HTML table. If *withyear* is true the year will be included in the header, otherwise just the month name will be used.
pl: Zwróć miesięczny kalendarz jako tabelę HTML. Jeśli *withyear* jest prawdziwe rok zostanie załączony w nagłówku, w przeciwnym przypadku tylko nazwa miesiąca będzie użyta.

source: Return a year's calendar as an HTML table. *width* (defaulting to 3) specifies the number of months per row.
pl: Zwróć roczny kalendarz jako tabelę HTML. *szerokość* - z ang. - *width* (domyślnie równa 3) określa liczbę miesięcy na wiersz.

source: Return a year's calendar as a complete HTML page. *width* (defaulting to 3) specifies the number of months per row. *css* is the name for the cascading style sheet to be used. :const:`None` can be passed if no style sheet should be used. *encoding* specifies the encoding to be used for the output (defaulting to the system default encoding).
pl: Zwróć kalendarz roczny jako kompletną stronę HTML. *szerokość* - z ang. - *width* (domyślnie równa 3) określa liczbę miesięcy na wiersz. *css* jest nazwą kaskadowego arkusza stylów do użycia. :const:`None` może być przekazane jeśli żaden arkusz stylów nie ma być użyty. *kodowanie* - z ang. - *encoding* określa kodowanie do użycia dla wyjścia (domyślnie domyślnego kodowania systemowego).

source: This subclass of :class:`TextCalendar` can be passed a locale name in the constructor and will return month and weekday names in the specified locale. If this locale includes an encoding all strings containing month and weekday names will be returned as unicode.
pl: To podrzędne uogólnienie uogólnienia :class:`TextCalendar` może otrzymać przekazaną nazwę lokalizacji w konstruktorze i zwróci miesiąc i dzień tygodnia w określonej lokalizacji. Jeśli ta lokalizacja zawiera kodowanie, wszystkie ciągi znaków zawierające nazwy miesiąca i dni tygodnia będą zwrócone jako Unicode.

source: This subclass of :class:`HTMLCalendar` can be passed a locale name in the constructor and will return month and weekday names in the specified locale. If this locale includes an encoding all strings containing month and weekday names will be returned as unicode.
pl: To podrzędne uogólnienie uogólnienia :class:`HTMLCalendar` może otrzymać przekazaną nazwę lokalizacji w konstruktorze i zwróci nazwy miesiąca i dni tygodnia w określonej lokalizacji. Jeśli ta lokalizacja zawiera kodowanie, wszystkie ciągi znaków zawierające nazwy miesięcy i dni tygodnia będą zwrócone jako Unicode.

source: For simple text calendars this module provides the following functions.
pl: Dla prostych kalendarzy tekstowych ten moduł dostarcza następujące zadania.

source: Sets the weekday (``0`` is Monday, ``6`` is Sunday) to start each week. The values :const:`MONDAY`, :const:`TUESDAY`, :const:`WEDNESDAY`, :const:`THURSDAY`, :const:`FRIDAY`, :const:`SATURDAY`, and :const:`SUNDAY` are provided for convenience. For example, to set the first weekday to Sunday::
pl: Ustawia dzień tygodnia (``0`` jest poniedziałkiem, ``6`` jest niedzielą) jako początek każdego tygodnia. Wartości :const:`MONDAY`, :const:`TUESDAY`, :const:`WEDNESDAY`, :const:`THURSDAY`, :const:`FRIDAY`, :const:`SATURDAY` i :const:`SUNDAY` są dostarczone dla wygody. Dla przykładu, aby ustawić pierwszy dzień tygodnia na Niedzielę::

source: Returns the current setting for the weekday to start each week.
pl: Zwraca obecne ustawienie dla dnia tygodnia którym zaczyna się każdy tydzień.

source: Returns :const:`True` if *year* is a leap year, otherwise :const:`False`.
pl: Zwraca :const:`True` jeśli *rok* - z ang - *year* jest przestępny w przeciwnym razie :const:`False`.

source: Returns the number of leap years in the range from *y1* to *y2* (exclusive), where *y1* and *y2* are years.
pl: Zwraca liczbę lat przestępnych w zakresie od *y1* do *y2* (wyłączając lata brzegowe) gdzie *y1* i *y2* są latami.

source: This function works for ranges spanning a century change.
pl: To zadanie pracuje dla zakresów rozpinających zmianę stulecia.

source: Returns the day of the week (``0`` is Monday) for *year* (``1970``--...), *month* (``1``--``12``), *day* (``1``--``31``).
pl: Zwraca dzień tygodnia (``0`` to poniedziałek) dla *roku* - z ang. - *year* (``1970``--...), *miesiąca* - z ang. - *month* (``1``--``12``), *dnia* - z ang - *day* (``1``--``31``).

source: Return a header containing abbreviated weekday names. *n* specifies the width in characters for one weekday.
pl: Zwróć nagłówek zawierający skrócone nazwy dni tygodnia. *n* określa szerokość w znakach dla jednego dnia tygodnia.

source: Returns weekday of first day of the month and number of days in month, for the specified *year* and *month*.
pl: Zwraca dzień tygodnia pierwszego dnia miesiąca i liczbę dni w miesiącu, dla określonego *roku* i *miesiąca*.

source: Returns a matrix representing a month's calendar. Each row represents a week; days outside of the month a represented by zeros. Each week begins with Monday unless set by :func:`setfirstweekday`.
pl: Zwraca matrycę reprezentującą kalendarz miesięczny. Każdy wiersz reprezentuje tydzień; dni poza miesiącem są reprezentowane przez zera. Każdy tydzień zaczyna się od poniedziałku chyba że ustawiono inaczej za pomocą zadania :func:`setfirstweekday`.

source: Prints a month's calendar as returned by :func:`month`.
pl: Wypisuje miesięczny kalendarz taki jak zwrócony przez zadanie :func:`month`.

source: Returns a month's calendar in a multi-line string using the :meth:`formatmonth` of the :class:`TextCalendar` class.
pl: Zwraca miesięczny kalendarz w wielo-liniowym ciągu znaków używając sposobu postępowania :meth:`formatmonth` uogólnienia :class:`TextCalendar`

source: Prints the calendar for an entire year as returned by :func:`calendar`.
pl: Wypisuje kalendarz dla całego roku jak zwrócony przez zadanie :func:`calendar`.

source: Returns a 3-column calendar for an entire year as a multi-line string using the :meth:`formatyear` of the :class:`TextCalendar` class.
pl: Zwróć 3-kolumnowy kalendarz dla całego roku jako wielo-liniowy ciąg znaków używając sposobu postępowania :meth:`formatyear` uogólnienia :class:`TextCalendar`.

source: An unrelated but handy function that takes a time tuple such as returned by the :func:`gmtime` function in the :mod:`time` module, and returns the corresponding Unix timestamp value, assuming an epoch of 1970, and the POSIX encoding. In fact, :func:`time.gmtime` and :func:`timegm` are each others' inverse.
pl: Niezwiązane ale użyteczne zadanie, które pobiera krotkę czasu taką jak zwracana przez zadanie :func:`gmtime` w module :mod:`time` i zwraca odpowiadającą wartość stempla czasowego Unix-a, przyjmując epokę 1970, i kodowanie POSIX. Faktycznie zadania :func:`time.gmtime` i :func:`timegm` są wzajemnymi przeciwieństwami.

source: The :mod:`calendar` module exports the following data attributes:
pl: Moduł :mod:`calendar` wystawia następujące właściwości danych:

source: An array that represents the days of the week in the current locale.
pl: Tabela która reprezentuje dni tygodnia w obecnej lokalizacji.

source: An array that represents the abbreviated days of the week in the current locale.
pl: Tabela która reprezentuje skrócone dni tygodnia w obecnej lokalizacji.

source: An array that represents the months of the year in the current locale. This follows normal convention of January being month number 1, so it has a length of 13 and ``month_name[0]`` is the empty string.
pl: Tabela która reprezentuje miesiące w roku w obecnej lokalizacji. To jest w zgodzie z konwencją według której styczeń jest miesiącem numer 1, więc ma długość 13 i ``month_name[0]`` jest pustym ciągiem znaków.

source: An array that represents the abbreviated months of the year in the current locale. This follows normal convention of January being month number 1, so it has a length of 13 and ``month_abbr[0]`` is the empty string.
pl: Tabela, która reprezentuje skrócone miesiące w roku w obecnej lokalizacji. To jest w zgodzie z konwencją, według której styczeń jest miesiącem numer 1, więc tabela ma długość 13 i ``month_abbr[0]`` jest pustym ciągiem znaków.

source: Object-oriented interface to dates and times with similar functionality to the :mod:`time` module.
pl: Zorientowany na przedmioty sprzęg dla dat i czasów z podobnymi funkcjonalnościami dla modułu :mod:`time`.

source: Low-level time related functions.
pl: Niskiego-poziomu zadania związane z czasem.

source: :mod:`cgi` --- Common Gateway Interface support
pl: :mod:`cgi` --- wsparcie dla wspólnego sprzęgu bramki - z ang. - Common Gateway Interface

source: Support module for Common Gateway Interface (CGI) scripts.
pl: Wspierający moduł dla skryptów sprzęgu wspólnej bramki (z ang. CGI).

source: This module defines a number of utilities for use by CGI scripts written in Python.
pl: Ten moduł definiuje pewną liczbę użyteczności dla użycia przez skrypty CGI napisane w języku pytonowskim.

source: Introduction
pl: Wprowadzenie

source: A CGI script is invoked by an HTTP server, usually to process user input submitted through an HTML ``<FORM>`` or ``<ISINDEX>`` element.
pl: Skrypt CGI jest wywoływany przez serwer HTTP, zwykle aby przetworzyć wejście użytkownika dostarczone przez HTML ``<FORM>`` lub element ``<ISINDEX>``.

source: Most often, CGI scripts live in the server's special :file:`cgi-bin` directory. The HTTP server places all sorts of information about the request (such as the client's hostname, the requested URL, the query string, and lots of other goodies) in the script's shell environment, executes the script, and sends the script's output back to the client.
pl: Najczęściej, Skrypty CGI przebywają w katalogu specjalnym serwera :file:`cgi-bin`. Serwer HTTP umieszcza wszelkiego rodzaju informacje o zapytaniu (takie jak nazwa hosta klienta, oczekiwany adres URL, ciąg zapytania, i wiele innych dobrych rzeczy) w środowisku powłoki skryptu, wykonuje skrypt i wysyła wyjście skryptu z powrotem do klienta.

source: The script's input is connected to the client too, and sometimes the form data is read this way; at other times the form data is passed via the "query string" part of the URL. This module is intended to take care of the different cases and provide a simpler interface to the Python script. It also provides a number of utilities that help in debugging scripts, and the latest addition is support for file uploads from a form (if your browser supports it).
pl: Wejście skryptu jest połączone z klientem także, i czasami dane formularza są wczytywane tą drogą także; innym razem dane formularza są przekazywane przez "ciąg zapytania" jako część adresu URL. Ten moduł jest przeznaczony do zajmowania się różnymi przypadkami i dostarczenia prostszego sprzęgu dla skryptu języka pytonowskiego. To także dostarcza pewną liczbę użyteczności które pomagają w odpluskwianiu skryptów zaś najnowszym dodatkiem jest wsparcie dla załadowywania plików przez formularz (jeśli twoja przeglądarka to wspomaga).

source: The output of a CGI script should consist of two sections, separated by a blank line. The first section contains a number of headers, telling the client what kind of data is following. Python code to generate a minimal header section looks like this::
pl: Wyjście skryptu CGI powinno składać się z dwóch sekcji, oddzielonych pustą linią. Pierwszy rozdział zawiera liczbę nagłówków, mówiąc klientowi jakiego rodzaju dane nastąpią potem. Kod języka pytonowskiego aby wytworzyć minimalny rozdział nagłówkowy wygląda następująco::

source: print("Content-Type: text/html") # HTML is following print() # blank line, end of headers
pl: print("Content-Type: text/html") # HTML następuje print() # pusty wiersz, koniec nagłówków

source: The second section is usually HTML, which allows the client software to display nicely formatted text with header, in-line images, etc. Here's Python code that prints a simple piece of HTML::
pl: Drugi rozdziałem jest zwykle HTML, który pozwala oprogramowaniu klienta wyświetlić ładnie sformatowany tekst z nagłówkiem, obrazkami w-jednej-linii itp. Tu jest kod języka pytonowskiego który drukuje prosty kawałek HTML-a::

source: print("<TITLE>CGI script output</TITLE>") print("<H1>This is my first CGI script</H1>") print("Hello, world!")
pl: print("<TITLE>Wyjście skryptu CGI</TITLE>") print("<H1>To jest mój pierwszy skrypt CGI</H1>") print("Witaj świecie!")

source: Using the cgi module
pl: Użycie modułu cgi

source: Begin by writing ``import cgi``.
pl: Zacznij przez napisanie ``import cgi``.

source: When you write a new script, consider adding these lines::
pl: Gdy piszesz nowy skrypt, rozważ dodanie tych linii::

source: This activates a special exception handler that will display detailed reports in the Web browser if any errors occur. If you'd rather not show the guts of your program to users of your script, you can have the reports saved to files instead, with code like this::
pl: To aktywuje specjalną obsługę błędów, która będzie wyświetlać szczegółowe raporty o błędach w przeglądarce sieciowej jeśli nastąpią jakiekolwiek błędy. Jeśli wolisz raczej nie pokazywać wnętrzności swojego programu dla użytkowników twojego skryptu możesz mieć raporty zapisane do pliku zamiast tego, za pomocą kodu takiego jak ten::

source: It's very helpful to use this feature during script development. The reports produced by :mod:`cgitb` provide information that can save you a lot of time in tracking down bugs. You can always remove the ``cgitb`` line later when you have tested your script and are confident that it works correctly.
pl: Jest bardzo przydatnym użycie tej właściwości w czasie rozwijania skryptu. Raporty produkowane przez :mod:`cgitb` dostarczają informację która może oszczędzić Ci wiele czasu w śledzeniu błędów. Możesz zawsze usunąć ``cgitb`` linię później gdy przetestowałeś swój skrypt i jesteś pewien że działa on prawidłowo.

source: To get at submitted form data, use the :class:`FieldStorage` class. Instantiate it exactly once, without arguments. This reads the form contents from standard input or the environment (depending on the value of various environment variables set according to the CGI standard). Since it may consume standard input, it should be instantiated only once.
pl: Aby dostać się do danych podanych przez formularz, użyj uogólnienia :class:`FieldStorage`. Daj przykład tego uogólnienia tylko raz, bez parametrów. To wczyta zawartość formularza ze standardowego wejścia środowiska (w zależności od wartości różnych zmiennych środowiskowych ustawionych zgodnie ze standardem CGI) Ponieważ może to pochłonąć standardowe wejście, powinno się dawać przykład tego uogólnienia tylko raz.

source: The :class:`FieldStorage` instance can be indexed like a Python dictionary. It allows membership testing with the :keyword:`in` operator, and also supports the standard dictionary method :meth:`keys` and the built-in function :func:`len`. Form fields containing empty strings are ignored and do not appear in the dictionary; to keep such values, provide a true value for the optional *keep_blank_values* keyword parameter when creating the :class:`FieldStorage` instance.
pl: Przykład uogólnienia :class:`FieldStorage` może być indeksowany jak słownik języka pytonowskiego. Pozwala to na sprawdzanie członkostwa za pomocą operatora :keyword:`in`, a także wsparcie standardowego sposobu postępowania słownika :meth:`keys` i wbudowanego zadania :func:`len`. Pola formularza zawierające puste ciągi znaków są ignorowane i nie pojawiają się w słowniku; Aby trzymać takie wartości dostarcz prawdziwą wartość dla opcjonalnego parametru słowa kluczowego *keep_blank_values* gdy tworzony jest przykład uogólnienia :class:`FieldStorage`.

source: For instance, the following code (which assumes that the :mailheader:`Content-Type` header and blank line have already been printed) checks that the fields ``name`` and ``addr`` are both set to a non-empty string::
pl: Dla przykładu, następujący kod (który zakłada, że nagłówek :mailheader:`Content-Type` i puste linie zostały już wydrukowane) sprawdza czy pola ``nazwa`` i ``addr`` zostały oba ustawione na nie-pusty ciąg znaków::

source: form = cgi.FieldStorage() if "name" not in form or "addr" not in form: print("<H1>Error</H1>") print("Please fill in the name and addr fields.") return print("<p>name:", form["name"].value) print("<p>addr:", form["addr"].value) ...further form processing here...
pl: form = cgi.FieldStorage() if "name" not in form or "addr" not in form: print("<H1>Błąd</H1>") print("Proszę wprowadź pola nazwa i adres.") return print("<p>name:", form["name"].value) print("<p>addr:", form["addr"].value) ...dalsza obróbka formularza tutaj...

source: Here the fields, accessed through ``form[key]``, are themselves instances of :class:`FieldStorage` (or :class:`MiniFieldStorage`, depending on the form encoding). The :attr:`value` attribute of the instance yields the string value of the field. The :meth:`getvalue` method returns this string value directly; it also accepts an optional second argument as a default to return if the requested key is not present.
pl: Tutaj pola, dostępne przez odwołanie ``form[key]``, są same w sobie przykładami uogólnienia :class:`FieldStorage` (lub :class:`MiniFieldStorage`, w zależności od kodowania formularza). Właściwość :attr:`value` przykładu wydaje wartość ciągu znaków tego pola. Sposób postępowania :meth:`getvalue` zwraca tę wartość ciągu znaków bezpośrednio; akceptuje także opcjonalny drugi parametr jako domyślny do zwrócenia jeśli oczekiwany klucz nie jest obecny.
